---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.GetCurrentElements
source: html/5f274e00-ed2f-38a6-6a25-aaffa3968520.htm
---
# Autodesk.Revit.DB.Structure.StructuralSectionsServiceData.GetCurrentElements Method

Returns the list of Ids of the current elements.

## Syntax (C#)
```csharp
public IList<ElementId> GetCurrentElements()
```

## Returns
Ids of the current elements. Contains the family base element to which the section shape type parameter belongs.